In [1]:
import pandas as pd
import numpy as np

In [2]:
 np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [3]:
## create a DataFrame
df=pd.DataFrame(data= np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1', 'column2', 'column3', 'column4'])

In [4]:
type(df)

pandas.core.frame.DataFrame

In [9]:
# the first five row of the data
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [10]:
# the last five row of the data
df.tail()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [11]:
#taking some rows of the data
df[["column1","column2","column3"]]

      column1  column2  column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14
Row5       16       17       18

In [12]:
# taking two columns of the data
df[["column1","column3"]]

      column1  column3
Row1        0        2
Row2        4        6
Row3        8       10
Row4       12       14
Row5       16       18